import React from 'react'
import TeamCard from './team-card';
import '../../styles/introduction.scss';
import TeamData from './../../utils/teamData';


/**
* @author
* @function Introduction
**/
const message="धार्मिक, सांस्कृतिक एवं ऐतिहासिक, मन्दिरै मन्दिरको नगरीको रुपमा परिचित ललितपुर नगर नेपाल उपत्यकाको प्राचीन तथा महत्वपूर्ण ३ नगरहरु मध्ये र्सवप्राचीन नगर हो । अनुपम कलानगरीको रुपमा सुपरिचित यो नगर सफाई तथा अन्य कार्यहरु गर्न वि सं. १९७५ सालमा जारी भएको 'पाटन सवाल' बाट 'छेमडोल अड्डा' को नामबाट संचालन भई वि. सं. २००९ सालमा ललितपुर नगरपालिका, वि. सं. २०१८ सालमा ललितपुर नगर पञ्‍चायत, वि. सं. २०४७ सालमा पुनः ललितपुर नगरपालिका र वि. सं. २०५२ सालमा ललिपुर उप-महानगरपालिकाको रुपमा कायम भएको छ  र २०७३/१२/१० मा ललितपुर महानगरपालिकाकाे रुपमा कायम भएकाे छ । यसरी ललितपुर महानगरपालिका नेपालको जेष्ठ नगरपालिका हो ।काठमाडौं उपत्यकाको प्रसिद्ध तीन शहरहरु मध्ये ललितपुर सवभन्दा पुरानो शहर मानिन्छ । यस शहरलाई प्राचीन कालदेखि हालसम्म समय अनुसार विभिन्न नामले चिनिदै आएको छ । जस्तै यल, युपग्राम, ललितपत्तन, ललितापुरी, मानिङ्गल, पाटन आदी । साहित्यिक श्रोत र जनश्रुतिअनुसार ललितपुर  शहर किरातकालमा नै  स्थापना भैसकेको थियो । उक्त जनश्रुति अनुसार ललितपुरको अर्को नाम 'यल' पहिलो किराती राजा यलम्वरको नामबाट राखिएको हो । तर केही वंशावलीहरुले भारतका मौर्य सम्राट अशोक इ.पू. २५० तिर काठमाडौं उपत्यकाको भ्रमण गरेको र उनले ललितपुरको चारकुना चार र विचमा एक समेत गरेर पाँच स्तूपको स्थापना गरेको कुरा उल्लेख गरेका छन । हालसम्म पनि ललितपुर चारदिशामा चारवटा प्राचीन स्तुपहरु रहेका छन । जुन अशोक स्तुपको नामले प्रख्यात छ । धार्मिक, सांस्कृतिक एवं ऐतिहासिक, मन्दिरै मन्दिरको नगरीको रुपमा परिचित ललितपुर नगर नेपाल उपत्यकाको प्राचीन तथा महत्वपूर्ण ३ नगरहरु मध्ये र्सवप्राचीन नगर हो । अनुपम कलानगरीको रुपमा सुपरिचित यो नगर सफाई तथा अन्य कार्यहरु गर्न वि सं. १९७५ सालमा जारी भएको 'पाटन सवाल' बाट 'छेमडोल अड्डा' को नामबाट संचालन भई वि. सं. २००९ सालमा ललितपुर नगरपालिका, वि. सं. २०१८ सालमा ललितपुर नगर पञ्‍चायत, वि. सं. २०४७ सालमा पुनः ललितपुर नगरपालिका र वि. सं. २०५२ सालमा ललिपुर उप-महानगरपालिकाको रुपमा कायम भएको छ  र २०७३/१२/१० मा ललितपुर महानगरपालिकाकाे रुपमा कायम भएकाे छ । यसरी ललितपुर महानगरपालिका नेपालको जेष्ठ नगरपालिका हो । काठमाडौं उपत्यकाको प्रसिद्ध तीन शहरहरु मध्ये ललितपुर सवभन्दा पुरानो शहर मानिन्छ । यस शहरलाई प्राचीन कालदेखि हालसम्म समय अनुसार विभिन्न नामले चिनिदै आएको छ । जस्तै यल, युपग्राम, ललितपत्तन, ललितापुरी, मानिङ्गल, पाटन आदी । साहित्यिक श्रोत र जनश्रुतिअनुसार ललितपुर  शहर किरातकालमा नै  स्थापना भैसकेको थियो । उक्त जनश्रुति अनुसार ललितपुरको अर्को नाम 'यल' पहिलो किराती राजा यलम्वरको नामबाट राखिएको हो । तर केही वंशावलीहरुले भारतका मौर्य सम्राट अशोक इ.पू. २५० तिर काठमाडौं उपत्यकाको भ्रमण गरेको र उनले ललितपुरको चारकुना चार र विचमा एक समेत गरेर पाँच स्तूपको स्थापना गरेको कुरा उल्लेख गरेका छन । हालसम्म पनि ललितपुर चारदिशामा चारवटा प्राचीन स्तुपहरु रहेका छन । जुन अशोक स्तुपको नामले प्रख्यात छ । धार्मिक, सांस्कृतिक एवं ऐतिहासिक, मन्दिरै मन्दिरको नगरीको रुपमा परिचित ललितपुर नगर नेपाल उपत्यकाको प्राचीन तथा महत्वपूर्ण ३ नगरहरु मध्ये र्सवप्राचीन नगर हो । अनुपम कलानगरीको रुपमा सुपरिचित यो नगर सफाई तथा अन्य कार्यहरु गर्न वि सं. १९७५ सालमा जारी भएको 'पाटन सवाल' बाट 'छेमडोल अड्डा' को नामबाट संचालन भई वि. सं. २००९ सालमा ललितपुर नगरपालिका, वि. सं. २०१८ सालमा ललितपुर नगर पञ्‍चायत, वि. सं. २०४७ सालमा पुनः ललितपुर नगरपालिका र वि. सं. २०५२ सालमा ललिपुर उप-महानगरपालिकाको रुपमा कायम भएको छ  र २०७३/१२/१० मा ललितपुर महानगरपालिकाकाे रुपमा कायम भएकाे छ । यसरी ललितपुर महानगरपालिका नेपालको जेष्ठ नगरपालिका हो । काठमाडौं उपत्यकाको प्रसिद्ध तीन शहरहरु मध्ये ललितपुर सवभन्दा पुरानो शहर मानिन्छ । यस शहरलाई प्राचीन कालदेखि हालसम्म समय अनुसार विभिन्न नामले चिनिदै आएको छ । जस्तै यल, युपग्राम, ललितपत्तन, ललितापुरी, मानिङ्गल, पाटन आदी । साहित्यिक श्रोत र जनश्रुतिअनुसार ललितपुर  शहर किरातकालमा नै  स्थापना भैसकेको थियो । उक्त जनश्रुति अनुसार ललितपुरको अर्को नाम 'यल' पहिलो किराती राजा यलम्वरको नामबाट राखिएको हो । तर केही वंशावलीहरुले भारतका मौर्य सम्राट अशोक इ.पू. २५० तिर काठमाडौं उपत्यकाको भ्रमण गरेको र उनले ललितपुरको चारकुना चार र विचमा एक समेत गरेर पाँच स्तूपको स्थापना गरेको कुरा उल्लेख गरेका छन । हालसम्म पनि ललितपुर चारदिशामा चारवटा प्राचीन स्तुपहरु रहेका छन । जुन अशोक स्तुपको नामले प्रख्यात छ । धार्मिक, सांस्कृतिक एवं ऐतिहासिक, मन्दिरै मन्दिरको नगरीको रुपमा परिचित ललितपुर नगर नेपाल उपत्यकाको प्राचीन तथा महत्वपूर्ण ३ नगरहरु मध्ये र्सवप्राचीन नगर हो । अनुपम कलानगरीको रुपमा सुपरिचित यो नगर सफाई तथा अन्य कार्यहरु गर्न वि सं. १९७५ सालमा जारी भएको 'पाटन सवाल' बाट 'छेमडोल अड्डा'को नामबाट संचालन भई वि. सं. २००९ सालमा ललितपुर नगरपालिका, वि. सं. २०१८ सालमा ललितपुर नगर पञ्‍चायत, वि. सं. २०४७ सालमा पुनः ललितपुर नगरपालिका र वि. सं. २०५२ सालमा ललिपुर उप-महानगरपालिकाको रुपमा कायम भएको छ  र २०७३/१२/१० मा ललितपुर महानगरपालिकाकाे रुपमा कायम भएकाे छ । यसरी ललितपुर महानगरपालिका नेपालको जेष्ठ नगरपालिका हो । काठमाडौं उपत्यकाको प्रसिद्ध तीन शहरहरु मध्ये ललितपुर सवभन्दा पुरानो शहर मानिन्छ । यस शहरलाई प्राचीन कालदेखि हालसम्म समय अनुसार विभिन्न नामले चिनिदै आएको छ । जस्तै यल, युपग्राम, ललितपत्तन, ललितापुरी, मानिङ्गल, पाटन आदी । साहित्यिक श्रोत र जनश्रुतिअनुसार ललितपुर  शहर किरातकालमा नै  स्थापना भैसकेको थियो । उक्त जनश्रुति अनुसार ललितपुरको अर्को नाम 'यल' पहिलो किराती राजा यलम्वरको नामबाट राखिएको हो । तर केही वंशावलीहरुले भारतका मौर्य सम्राट अशोक इ.पू. २५० तिर काठमाडौं उपत्यकाको भ्रमण गरेको र उनले ललितपुरको चारकुना चार र विचमा एक समेत गरेर पाँच स्तूपको स्थापना गरेको कुरा उल्लेख गरेका छन । हालसम्म पनि ललितपुर चारदिशामा चारवटा प्राचीन स्तुपहरु रहेका छन । जुन अशोक स्तुपको नामले प्रख्यात छ ।";

const IntroductionMain = (props) => {
  return(
    <div className="container1">
      <div className="brief-intro" >
        <div className="Intro-Top" >
          <h2>संक्षिप्त परिचय</h2>
      <div className="intro-after"></div>
        </div>
        <div className="introduction-conetent" >
      <p className="mt">
        {message}

      </p>
      {/* <div className="IntrodctionTable" style={{width:"80%"}}>

      </div> */}

        </div>
  

    </div>
    <div className="team-wrapper">
      <div className="Intro-Top">
      <h2>पदाधिकारीहरु</h2>
    <div className="intro-after"></div>
      </div>
    <div className="our-team">
{
TeamData.map((value)=>{
return(<TeamCard 
image={value.image}
name={value.name}
post={value.post}
email={value.email}
emailseccond={value.emailseccond}
phone={value.phone}
/>)
})
}
</div>
</div>
</div>
   )

 }

export default IntroductionMain